import nonebot

Bot_NICKNAME: str = list(nonebot.get_driver().config.nickname)[0]
Bot_MASTER: str = list(nonebot.get_driver().config.superusers)[0]

# 呜呜呜
wu_wu = [
    "哭jb哭，不许哭",
    "怎么哭了啊，别哭别哭",
    "别哭了，摸摸~",
    "你哭你🐎呢",
    "发生什么事了捏"
]

# 二次元浓度隐藏词
potency = [
    '浓度过高，检测不出',
    '唔，二次元的酸臭味',
    '一眼丁真，鉴定为傻卵二次元',
    f'{Bot_NICKNAME}不想理二次元',
]

# hello之类的回复
hello__reply = [
    "你好！",
    "哦呀？！",
    "你好！Ov<",
    f"库库库，呼唤{Bot_NICKNAME}做什么呢",
    "我在呢！",
    "呼呼，叫俺干嘛",
]


# 戳一戳消息
poke__reply = [
    "lsp你再戳？",
    "连个可爱美少女都要戳的肥宅真恶心啊。",
    "你再戳！",
    "？再戳试试？",
    "别戳了别戳了再戳就坏了555",
    "我爪巴爪巴，球球别再戳了",
    "你戳你🐎呢？！",
    f"请不要戳{Bot_NICKNAME} >_<",
    "放手啦，不给戳QAQ",
    f"喂(#`O′) 戳{Bot_NICKNAME}干嘛！",
    "戳坏了，赔钱！",
    "戳坏了",
    "嗯……不可以……啦……不要乱戳",
    "那...那里...那里不能戳...绝对...",
    "(。´・ω・)ん?",
    "有事恁叫我，别天天一个劲戳戳戳！",
    "欸很烦欸！你戳🔨呢",
    "再戳一下试试？",
    "啊呜，太舒服刚刚竟然睡着了。什么事？",
]

# 嘉然
ran_pi = [
    '卧槽！有嘉心糖',
    '嘉心糖能不能爬',
    '嘉心糖收收味',
    f'{Bot_NICKNAME}最讨厌嘉心糖了',
    '有然批',
]
